# inserting the image
![png](ERD_Diagram.png)

In [1]:
# importing required packages
from sqlalchemy import create_engine
import pandas as pd

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
q = '''DESCRIBE users;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [4]:
q = '''DESCRIBE books;'''
describe = pd.read_sql(q, conn)
describe

        Field         Type Null  Key Default           Extra
0          id          int   NO  PRI    None  auto_increment
1       title  varchar(45)  YES         None
2  authors_id          int   NO  MUL    None

In [6]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, conn)
describe

         Field         Type Null  Key Default           Extra
0           id          int   NO  PRI    None  auto_increment
1  author_name  varchar(45)  YES         None

In [7]:
q = '''DESCRIBE favorites'''
describe = pd.read_sql(q, conn)
describe

      Field Type Null  Key Default Extra
0  books_id  int   NO  MUL    None
1  users_id  int   NO  MUL    None

In [8]:
# Load the data into DataFrames
users_df = pd.read_csv("users  - users.csv")
books_df = pd.read_csv("books - books.csv")
authors_df = pd.read_csv("authors - authors.csv")
favorites_df = pd.read_csv("favorites - favorites.csv")

In [9]:
books_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

In [10]:
books_df.rename(columns={'author_id': 'authors_id'}, inplace=True)

In [11]:
books_df.head()

   id                 title  authors_id
0   1           The Shining           1
1   2                    It           1
2   3      The Great Gatsby           2
3   4  The Call of the Wild           3
4   5   Pride and Prejudice           4

In [12]:
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

In [13]:
authors_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [14]:
favorites_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

In [15]:
favorites_df.rename(columns={'user_id': 'users_id', 'book_id': 'books_id'}, inplace=True)

In [16]:
favorites_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   users_id  7 non-null      int64
 1   books_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

In [17]:
# Add data from DataFrame to the 'users' table
users_df.to_sql('users', engine, if_exists='append', index=False)

3

In [18]:

# Add data from DataFrame to the 'authors' table
authors_df.to_sql('authors', engine, if_exists='append', index=False)

5

In [19]:
# Add data from DataFrame to the 'books' table
books_df.to_sql('books', engine, if_exists='append', index=False)

6

In [20]:
favorites_df.head()

   users_id  books_id
0         1         1
1         1         2
2         1         3
3         2         4
4         2         5

In [21]:
# Add data from DataFrame to the 'favorites' table
favorites_df.to_sql('favorites', engine, if_exists='append', index=False)

7

In [24]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [26]:
# Preview the names of all tables 
q = '''
Select * 
From users;
'''
pd.read_sql(q, engine)

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [27]:
q = '''SELECT books.title, favorites.users_id
FROM books
JOIN favorites ON books.id = favorites.books_id
WHERE favorites.users_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
'''

pd.read_sql(q,engine)

              title  users_id
0       The Shining         1
1                It         1
2  The Great Gatsby         1